//==========================================================
//
// 弾の処理管理 [bulletmanager.h]
// Author : Ibuki Okusada
//
//==========================================================
#ifndef _BULLETMANAGER_H_		// このマクロが定義されていない場合
#define _BULLETMANAGER_H_		// 二重インクルード防止用マクロを定義

// 前方宣言
class CBullet;

//==========================================================
// 弾クラス管理のクラス定義(基底クラス)
//==========================================================
class CBulletManager
{
public:		// 誰でもアクセス可能

private:	// 自分だけがアクセス可能

	
};

#endif